Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
df = pd.read_csv("airtravel.csv")

In [2]:
df.head()

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472

In [3]:
df.tail()

   Month   "1958"   "1959"   "1960"
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [5]:
df.columns

Index(['Month', ' "1958"', ' "1959"', ' "1960"'], dtype='object')

In [6]:
df.describe()

           "1958"      "1959"      "1960"
count   12.000000   12.000000   12.000000
mean   381.000000  428.333333  476.166667
std     64.530472   69.830097   77.737125
min    310.000000  342.000000  390.000000
25%    339.250000  387.500000  418.500000
50%    360.500000  406.500000  461.000000
75%    411.750000  465.250000  514.750000
max    505.000000  559.000000  622.000000

In [11]:
pd.Categorical(df['Month'])

['JAN', 'FEB', 'MAR', 'APR', 'MAY', ..., 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']
Length: 12
Categories (12, object): ['APR', 'AUG', 'DEC', 'FEB', ..., 'MAY', 'NOV', 'OCT', 'SEP']

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [17]:
df1 = pd.DataFrame({'A': [1,2,3,4,5,6] , 'B': [11,22,33,44,55,66], 'C' : [111, 222,333,444,555,666]})

In [18]:
df1

   A   B    C
0  1  11  111
1  2  22  222
2  3  33  333
3  4  44  444
4  5  55  555
5  6  66  666

In [25]:
def reindex_dataframe(df1):
    new_index = pd.Index(range(1, len(df1)*2, 2))
    df1 = df1.set_index(new_index)
    return df1

In [26]:
reindex_dataframe(df1)

    A   B    C
1   1  11  111
3   2  22  222
5   3  33  333
7   4  44  444
9   5  55  555
11  6  66  666

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [12]:
df3 =  pd.DataFrame({'Values': [10, 20, 30, 40, 50, 60]})

In [13]:
df3

   Values
0      10
1      20
2      30
3      40
4      50
5      60

In [14]:
sum([i for i in df3['Values'][0:3]])

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [24]:
import pandas as pd

data = {'Text':['Machine Learning','Data Science Masters', 'Deep Learning with']}

df = pd.DataFrame(data)

df['Word_Count'] = df['Text'].str.count(' ') + 1

In [25]:
df

                      Text  Word_Count
0         Machine Learning           2
1  Artificial Intelligence           2
2     Data Science Masters           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans) DataFrame.size() - Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

DataFrame.shape() - Returns tuple of shape (Rows, columns) of dataframe/series.

In [38]:
import pandas as pd
df1 = pd.read_csv("airtravel.csv") 

size = df1.size

print("Size = {}".format(size))

Size = 48

In [41]:
import pandas as pd
df1 = pd.read_csv("airtravel.csv") 

shape = df1.shape

print("Shape = {}".format(shape))

Shape = (12, 4)

Q6. Which function of pandas do we use to read an excel file?

Ans) The pandas module read_excel() function to read the excel file data into a DataFrame object.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.


The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username' column.

In [3]:
import pandas as pd
df = pd.DataFrame({'Email':['rohankumar@gmail.com','sunil_mohan@gmail.com', 'singh.sanjeev@yahoo.com', 'maheshtiwari@outlook.com' ]})

df['Username'] = df['Email'].str.split('@').str[0]

In [4]:
df

                      Email       Username
0      rohankumar@gmail.com     rohankumar
1     sunil_mohan@gmail.com    sunil_mohan
2   singh.sanjeev@yahoo.com  singh.sanjeev
3  maheshtiwari@outlook.com   maheshtiwari

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:

  A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

Your function should select the following rows: A B C

1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [5]:
df2 = pd.DataFrame({ "A" : [3,8,6,2,9], "B": [5,2,9,3,1], "C": [1,7,4,5,2]})

In [6]:
df2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [11]:
pd.DataFrame(df2[(df2['A']>5 ) & (df2['B']< 10)])

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [30]:
df3

   Values
0      10
1      20
2      30
3      40
4      50
5      60

In [31]:
df3.describe()

          Values
count   6.000000
mean   35.000000
std    18.708287
min    10.000000
25%    22.500000
50%    35.000000
75%    47.500000
max    60.000000

In [32]:
df3.mean()

Values    35.0
dtype: float64

In [33]:
df3.median()

Values    35.0
dtype: float64

In [34]:
df3.mode()

   Values
0      10
1      20
2      30
3      40
4      50
5      60

In [35]:
df3.std()

Values    18.708287
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'Moving Average' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [38]:
Date = pd.date_range(start = '2023-03-01', end = '2023-03-15')
df4 = pd.DataFrame({"Date":Date, "Sales" : [100, 200, 300,400, 500, 600, 700,800,900,875,954, 897,876,1000,1200]})

In [40]:
df4['Moving_Average'] = df4.rolling(window=7).mean()

/tmp/ipykernel_102/739650913.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df4['Moving_Average'] = df4.rolling(window=7).mean()

In [41]:
df4

         Date  Sales  Moving_Average
0  2023-03-01    100             NaN
1  2023-03-02    200             NaN
2  2023-03-03    300             NaN
3  2023-03-04    400             NaN
4  2023-03-05    500             NaN
5  2023-03-06    600             NaN
6  2023-03-07    700      400.000000
7  2023-03-08    800      500.000000
8  2023-03-09    900      600.000000
9  2023-03-10    875      682.142857
10 2023-03-11    954      761.285714
11 2023-03-12    897      818.000000
12 2023-03-13    876      857.428571
13 2023-03-14   1000      900.285714
14 2023-03-15   1200      957.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [45]:
Date = pd.date_range(start = '2023-01-23', end = '2023-01-29')
df5 = pd.DataFrame({'Date' : Date})

In [46]:
df5["Weekday"] = df5['Date'].dt.day_name()

In [47]:
df5

        Date    Weekday
0 2023-01-23     Monday
1 2023-01-24    Tuesday
2 2023-01-25  Wednesday
3 2023-01-26   Thursday
4 2023-01-27     Friday
5 2023-01-28   Saturday
6 2023-01-29     Sunday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [62]:
d = pd.date_range(start = '2022-12-01', end = '2023-03-31')
df6 = pd.DataFrame({'Date':d})

In [63]:
df6.head()

        Date
0 2022-12-01
1 2022-12-02
2 2022-12-03
3 2022-12-04
4 2022-12-05

In [64]:
def select_date_range(df6, start_date, end_date):
    mask = (df6['Date']>= start_date) & (df6['Date']<= end_date)
    return df6[mask]

In [66]:
selected_df = select_date_range(df6, '2023-01-01', '2023-01-31')
df6 = pd.DataFrame(selected_df)

In [67]:
df6

         Date
31 2023-01-01
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30
61 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans) The first and foremost library that needs to be imported is "Pandas".